### CS-500 Homework 1. Part 1

- Contains 9 problems, 45 pts in total

#### Homework Instructions

1. Begin this homework by modifying the variable DREXEL_USERNAME in the next cell
    * Set the variable to your Drexel username (e.g., "db59")
2. Run all cells in this notebook before proceeding with solving problems
    * Select "Cell" -> "Run All" from the top menu bar
      * menu "Cell" is between "Insert" and "Kernel" options
3. Problems that are provided between the cells `EXAMPLE PROBLEMS BEGIN HERE`  and  `EXAMPLE PROBLEMS END HERE` in this notebook are sample problems. And you do not need to solve them
4. Answer problems with points assigned in square brackets
  * for example: `[5 pts]`
  * Put your SQL query at the end of the cell that defines the problem
  * Your answers should follow similar format as example problems
  * You can see results of your query by running each cell with `CTRL+ENTER` (`CMD+ENTER` on macOS)
  * We will execute SQL statements differently than in Lecture 1 and 2
    * For this homework, we will use `%%sql` magick for ipython to enter SQL queries
    * Invoking `%%sql` on the first line of a cell allows us to enter SQL query using SQL sytax directly
      * (i.e., as opposed to running the query via Python code when SQL query is specified as a Python string
    * Support for `%%sql` magick is installed via `ipython-sql` library (see cell with imports below)
5. Make sure you **save your work in this notebook regularly** by pressing `CTRL+S` (`CMD+S` on macOS)
* Submit this notebook with your answers along with **the completed notebook for part 2**.

In [1]:
### CHANGE THIS TO YOUR DREXEL USERNAME!
DREXEL_USERNAME="mht47"

In [2]:
## This cell installs python (pypi) packages, then imports modules referenced in this notebook
import ipydeps
ipydeps.pip(["wand", "json", "lxml", "redis", "sqlite3", "pandas", "numpy", "pillow", "bokeh", "sqlalchemy"])
from IPython.display import IFrame    
from wand.image import Image as WImage
from IPython.display import display
import ipywidgets as widgets
import numpy as np
import pandas as pd
from sqlalchemy import create_engine

### we are going to use a jupyter's magick commands %sql or %%sql to run queries
##  install pip package for the sql magick:
ipydeps.pip([ "ipython-sql"])  
## load sql magick (ipython extension)
%load_ext sql

### EXAMPLE PROBLEMS BEGIN HERE

In [3]:
%%sql sqlite:///company.db
-- you can use %%sql magick to execute a query that spans multiple lines.
-- However, %%sql magick command must appear on the first line of a cell to work!
-- Also, everything past the line '%%sql sqlite:///company.db' must have valid SQL syntax.
-- Note that '--' is the comment symbol in SQL.
-- 
-- Example Problem:
--   Retrieve all rows and all columns of employee table
-- 

SELECT * FROM employee;

Done.

[('John', 'B', 'Smith', '123456789', '1965-01-09', '731 Fondren, Houston, TX', 'M', 30000.0, '333445555', 5),
 ('Franklin', 'T', 'Wong', '333445555', '1955-01-09', '638 Voss, Houston, TX', 'M', 40000.0, '888665555', 5),
 ('Alicia', 'J', 'Zelaya', '999887777', '1968-01-09', '3321 Castle, Spring, TX', 'F', 25000.0, '987654321', 4),
 ('Jennifer', 'S', 'Wallace', '987654321', '1941-01-09', '291 Berry, Bellaire, TX', 'F', 43000.0, '888665555', 4),
 ('Ramesh', 'K', 'Narayan', '666884444', '1962-01-09', '975 Fire Oak, Humble, TX', 'M', 38000.0, '333445555', 5),
 ('Joyce', 'A', 'English', '453453453', '1972-01-09', '5631 Rice, Houston, TX', 'F', 25000.0, '333445555', 5),
 ('Ahmad', 'V', 'Jabbar', '987987987', '1969-01-09', '980 Dallas, Houston, TX', 'M', 25000.0, '987654321', 4),
 ('James', 'E', 'Borg', '888665555', '1937-01-09', '450 Stone, Houston, TX', 'M', 55000.0, None, 1)]

In [4]:
%%sql sqlite:///company.db
select * from works_on;

Done.

[('123456789', 1, 32.5),
 ('123456789', 2, 7.5),
 ('666884444', 3, 40.0),
 ('453453453', 1, 20.0),
 ('453453453', 2, 20.0),
 ('333445555', 2, 10.0),
 ('333445555', 3, 10.0),
 ('333445555', 10, 10.0),
 ('333445555', 20, 10.0),
 ('999887777', 30, 30.0),
 ('999887777', 10, 10.0),
 ('987987987', 10, 35.0),
 ('987987987', 30, 5.0),
 ('987654321', 30, 20.0),
 ('987654321', 20, 15.0),
 ('888665555', 20, None)]

In [5]:
%%sql sqlite:///company.db
-- EXAMPLE PROBLEM:
--   Display employees whose name begins with J
SELECT fname
FROM employee
WHERE fname LIKE 'J%';

Done.

[('John',), ('Jennifer',), ('Joyce',), ('James',)]

In [6]:
%%sql sqlite:///company.db
--
-- EXAMPLE PROBLEM:
--   Display the names of projects that are based out of houston or stafford

select * from dept_locations
where dlocation in ('Houston','Stafford');

Done.

[(1, 'Houston'), (4, 'Stafford'), (5, 'Houston')]

In [7]:
%%sql sqlite:///company.db
--
-- EXAMPLE PROBLEM:
-- Display the ssn of employees sorted by their salary in ascending mode
-- 
select ssn, salary, dno
from employee
where dno = 5
order by salary asc;

Done.

[('453453453', 25000.0, 5),
 ('123456789', 30000.0, 5),
 ('666884444', 38000.0, 5),
 ('333445555', 40000.0, 5)]

In [8]:
%%sql sqlite:///company.db
--
-- EXAMPLE PROBLEM:
-- Display the number of employees who do not have a manager
select *
  from employee
where super_ssn IS NULL;

Done.

[('James', 'E', 'Borg', '888665555', '1937-01-09', '450 Stone, Houston, TX', 'M', 55000.0, None, 1)]

In [9]:
%%sql sqlite:///company.db
--
-- EXAMPLE PROBLEM:
--   Display the average, minimum, maximum hours spent in each project

select pno, avg(hours), min(hours), max(hours)
from works_on
group by pno;

Done.

[(1, 26.25, 20.0, 32.5),
 (2, 12.5, 7.5, 20.0),
 (3, 25.0, 10.0, 40.0),
 (10, 18.333333333333332, 10.0, 35.0),
 (20, 12.5, 10.0, 15.0),
 (30, 18.333333333333332, 5.0, 30.0)]

In [10]:
%%sql sqlite:///company.db
--
-- EXAMPLE PROBLEM:
--   Display the fname and salary of employees whose salary is more than the average salary of all the employees
select fname, salary
from employee
where salary >= (select avg(salary) from employee);

Done.

[('Franklin', 40000.0),
 ('Jennifer', 43000.0),
 ('Ramesh', 38000.0),
 ('James', 55000.0)]

In [11]:
%%sql sqlite:///company.db
--
-- EXAMPLE PROBLEM:
--   What is the name of the department that has least number of  employees?

select dname 
 from employee e, department d 
 where e.dno=d.dnumber 
 group by dno having count(ssn) =
     (select min(mycount) 
      from (select count(ssn) as mycount 
           from employee
            group by dno
           ) mytable
     );

Done.

[('Headquarters',)]

In [12]:
%%sql sqlite:///company.db
--
-- EXAMPLE PROBLEM:
--   Which project(s) have the least number of employees?

select pno, count(*) numemps 
from works_on 
group by pno 
having numemps = 
(select min(nemps) 
from (
select pno, count(*) nemps 
from works_on group by pno
     ) tempproj
 );

Done.

[(1, 2), (3, 2)]

### EXAMPLE PROBLEMS END HERE

### Answer all problems below

In [23]:
%%sql sqlite:///company.db
-- 
-- PROBLEM 1 [5 pts]
-- Display the SSN of all employees who live in Houston
--    (Hint: use LIKE() function as in address LIKE '%Houston'
       
select ssn from employee where address like '%Houston, TX'

Done.

[('123456789',),
 ('333445555',),
 ('453453453',),
 ('987987987',),
 ('888665555',)]

In [32]:
%%sql sqlite:///company.db
--
-- PROBLEM 2 [5 pts]
--   What is the average salary of employees who do not have a manager

select
avg(e.salary) as avg_salary
from employee e where e.super_ssn is null;

Done.

[(55000.0,)]

In [33]:
%%sql sqlite:///company.db
-- 
-- PROBLEM 3 [5 pts]  
--   Sort the works_on table based on Pno and Hours

select * from works_on
order by pno, hours;

Done.

[('453453453', 1, 20.0),
 ('123456789', 1, 32.5),
 ('123456789', 2, 7.5),
 ('333445555', 2, 10.0),
 ('453453453', 2, 20.0),
 ('333445555', 3, 10.0),
 ('666884444', 3, 40.0),
 ('333445555', 10, 10.0),
 ('999887777', 10, 10.0),
 ('987987987', 10, 35.0),
 ('888665555', 20, None),
 ('333445555', 20, 10.0),
 ('987654321', 20, 15.0),
 ('987987987', 30, 5.0),
 ('987654321', 30, 20.0),
 ('999887777', 30, 30.0)]

In [36]:
%%sql sqlite:///company.db
--
-- PROBLEM 4 [5 pts]
-- Display the names of the project that are neither based out of houston nor out of stafford
--      hint a) Use AND/OR clause
--           b) use NOT IN clause as in Plocation NOT IN ('Houston','Stafford')

select
p.pname
,d.dname
,dl.dlocation
from department d
left join dept_locations dl on d.dnumber = dl.dnumber
left join project p on d.dnumber = p.dnum
where dl.dlocation not in ('Houston','Stafford');

Done.

[('ProductX', 'Research', 'Bellaire'),
 ('ProductY', 'Research', 'Bellaire'),
 ('ProductZ', 'Research', 'Bellaire'),
 ('ProductX', 'Research', 'Sugarland'),
 ('ProductY', 'Research', 'Sugarland'),
 ('ProductZ', 'Research', 'Sugarland')]

In [42]:
%%sql sqlite:///company.db
-- 
-- PROBLEM 5 [5 pts]  
-- Retrieve details of projects that are based out Houston or belongs to deptartment 4

select
p.*
from department d
left join dept_locations dl on d.dnumber = dl.dnumber
left join project p on d.dnumber = p.dnum
where p.plocation = 'Houston' or d.dnumber = 4;

Done.

[('ProductZ', 3, 'Houston', 5),
 ('ProductZ', 3, 'Houston', 5),
 ('ProductZ', 3, 'Houston', 5),
 ('Computerization', 10, 'Stafford', 4),
 ('Reorganization', 20, 'Houston', 1),
 ('Newbenefits', 30, 'Stafford', 4)]

In [46]:
%%sql sqlite:///company.db
--
-- PROBLEM 6 [5 pts]
--  What is the highest salary of female employees

select
max(e.salary) as max_salary
from employee e
where e.sex = 'F';

Done.

[(43000.0,)]

In [47]:
%%sql sqlite:///company.db
--
-- PROBLEM 7 [5 pts]
--   What is the least salary of male employees

select
min(e.salary) as min_salary
from employee e
where e.sex = 'M';

Done.

[(25000.0,)]

In [57]:
%%sql sqlite:///company.db
--
-- PROBLEM 8 [5 pts]
--   Display the number of projects each employee is working on

select
e.ssn
,e.fname ||' ' || e.minit || ' ' || e.lname as name
,count(p.pnumber) as project_count
from works_on w
left join employee e on w.essn = e.ssn
left join project p on w.pno = p.pnumber
group by e.ssn, e.fname ||' ' || e.minit || ' ' || e.lname

Done.

[('123456789', 'John B Smith', 2),
 ('333445555', 'Franklin T Wong', 4),
 ('453453453', 'Joyce A English', 2),
 ('666884444', 'Ramesh K Narayan', 1),
 ('888665555', 'James E Borg', 1),
 ('987654321', 'Jennifer S Wallace', 2),
 ('987987987', 'Ahmad V Jabbar', 2),
 ('999887777', 'Alicia J Zelaya', 2)]

In [66]:
%%sql sqlite:///company.db
--
-- PROBLEM 9 [5 pts]
--   What is the name of the department whose employees have the highest   average salary?


select
d.dname
,avg(e.salary) as avg_salary
from employee e
join department d on e.dno = d.dnumber
group by d.dname
order by avg_salary desc
limit 1;

Done.

[('Headquarters', 55000.0)]